# -*- coding: utf-8  -*-
#!/usr/local/bin/python

ZY_SELL_CHOICES = (
    (1, '仅选座'),
    (2, '仅通兑'),
    (3, '选座和通兑'),
    (4, '仅查排期'),
)


CINEMA_FEATURE_TYPE = (
    (0, "影院自身服务"),
    (1, "乐影客影院合作服务"),
)


ZY_CINEMA_SERVICES = (
    (0, "停车场"),
    (1, "IMAX"),
    (2, "周边购物"),
    (3, "卖品"),
    (4, "休息区"),
    (5, '餐厅'),
    (6, '情侣座'),
    (7, '3D'),
)


LYK_CINEMA_SERVICES = {
    0: "爆米花+饮料（折扣）",
    1: "专享WiFi",
    2: "停车优惠券",
    3: "手机充电宝",
    4: "VIP专享休息区",
    5: "儿童票",
    6: "定制观影纪念册",
    7: "靠枕",
    8: "空调毯",
    9: "周边餐厅优惠券",
    10: "周边咖啡厅优惠券",
}


CINEMA_IMAGE_TYPE = (
    (0, 'Logo'),
    (1, '宣传照'),
)

SEAT_TYPE_CHOICE = (
    (0, '座位'),
    (1, '空座位'),
    (2, '通道')
)
